import React from "react";
const Questions = () => {
    return (
        <div className="row g-4 row-cols-1 row-cols-lg-2">
            <div className="col">
                <div className="card h-100">
                    <div className="card-body text-start">
                        <h5 className="card-title fw-bold">রিয়েক্ট কিভাবে কাজ করে?</h5>
                        <p className="card-text"> রিঅ্যাক্ট সেইম টু সেইম ব্রাউজারে ডমের মতো করে আরেকটা ডম তৈরী করে যেটাকে ভার্চুয়াল ডম বলা হয়। এখন এই ডম দেখতে পুরো সেই আসল ডমের মতোই, কিন্তু এই ভার্চুয়াল ডমটা আসলে একটা জাভাস্ক্রিপ্ট অবজেক্ট। রিঅ্যাক্ট এটাকে এমনভাবে তৈরী করে যে এই ডমের সাথে সহজেই জাভাস্ক্রিপ্ট ইউজ করে যেকোনো ইলিমেন্ট মডিফাই করা যায় কম সময়ের মধ্যে এবং এফিসিয়েন্টলি। রিঅ্যাক্ট একটা না বরং দুইটা ভার্চুয়াল ডম তৈরী করে। ইউজার যখন রিঅ্যাক্ট অ্যাপের মধ্যে কোনো অ্যাকশন নেয় তখন রিঅ্যাক্ট দুইটা ভার্চুয়াল ডমের মধ্যে একটাতে সেই চেঞ্জগুলো রাখে, আর আরেকটা থাকে আগের ভার্শনের। এখন আগেরটার সাথে নতুনটার তুলনা করে রিঅ্যাক্ট দেখে আসলে স্পেসেফিক ঠিক কোন ইলিমেন্ট পরিবর্তন করা হয়েছে। সে অনুসারে রিঅ্যাক্ট পুরো ডমটাকে রি-রেন্ডার না করে শুধুমাত্র যেই জিনিসটা চেঞ্জ হয়েছে সেটাকেই চেঞ্জ করে। এতে সহজেই দ্রুত কাজ হয়ে যায় আর অতিরিক্ত, অপ্রয়োজনীয় কোনো কাজও করতে হয় না ব্রাউজারের।</p>
                    </div>
                </div>
            </div>
            <div className="col">
                <div className="card h-100">
                    <div className="card-body text-start">
                        <h5 className="card-title fw-bold">প্রপস এবং স্টেইট মধ্যে পার্থক্য?</h5>
                        <div className="card-text">
                            <h5>প্রপস</h5>
                            <ul>
                                <li>প্রপস শুধুমাত্র রিড করা যায়।</li>
                                <li>স্টেটলেস কম্পোনেন্টে প্রপস থাকতে পারে।</li>
                                <li>কম্পোনেন্ট গুলোর মধ্যে যোগাযোগ করতে প্রপস ব্যবহার করা হয়।</li>
                                <li>প্রপস চাইল্ড উপাদান দ্বারা অ্যাক্সেস করা যেতে পারে</li>
                            </ul>
                            <h5>স্টেইট</h5>
                            <ul>
                                <li>স্টেইট উপাদান সম্পর্কে তথ্য ধারণ করে.</li>
                                <li>স্টেইট চাইল্ড উপাদান দ্বারা অ্যাক্সেস করা যাবে না.</li>
                                <li>স্টেইট কম্পোনেন্ট পুনরায় ব্যবহারযোগ্য করতে পারে না</li>
                                <li>স্টেইট কম্পোনেন্ট সম্পর্কে তথ্য ধারণ করে.</li>
                            </ul>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    )
}
export default Questions;